# Energy Analysis Zone Humidification Set Point Property

Source: https://www.revitapidocs.com/2026/737f5587-a5b8-d5e5-c6a5-1a7e5043527b.htm

---

| Energy Analysis Zone Humidification Set Point Property |
| --- |

The humidification set point as a number between 0 and 1\.
**Namespace:** Autodesk.Revit.DB.Analysis
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public double HumidificationSetPoint { get; }
```

```
Public ReadOnly Property HumidificationSetPoint As Double
	Get
```

```
public:
property double HumidificationSetPoint {
	double get ();
}
```

```
member HumidificationSetPoint : float with get
```

#### Property Value

Double See Also

#### Reference

EnergyAnalysisZone Class Autodesk.Revit.DB.Analysis Namespace